neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_aesadv.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_aesadv.h
 *  @brief      Advanced Encryption Standard Advanced (AESADV) Driver Library
 *  @defgroup   AESADV Advanced Encryption Standard Advanced (AESADV)
 *
 *  @anchor ti_dl_dl_aesadv_Overview
 *  # Overview
 *
 *  The AESADV DriverLib allows full configuration of the MSPM0 AESADV module.
 *  The AESADV accelerator module accelerates encryption and decryption
 *  operations in hardware based on the FIPS PUB 197 advanced encryption
 *  standard (AES).
 *
 *  <hr>
 ******************************************************************************/
/** @addtogroup AESADV
 * @{
 */
#ifndef ti_dl_dl_aesadv__include
#define ti_dl_dl_aesadv__include

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>

#include <inc/msp.h>
#include <driverlib/dl_common.h>

#ifdef __MSPM0_HAS_AESADV__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_AESADV_INTERRUPT
 *  @{
 */

/*!
 *  @brief AESADV Output Ready interrupt
 *
 *  @note Not compatible with the use of @ref DL_AESADV_enableDMAOperation
 */
#define DL_AESADV_INTERRUPT_OUTPUT_READY                                       \
                                       (AESADV_CPU_INT_IMASK_OUTPUTRDY_SET)

/*!
 *  @brief AESADV Input Ready interrupt
 *
 *  @note Not compatible with the use of @ref DL_AESADV_enableDMAOperation
 */
#define DL_AESADV_INTERRUPT_INPUT_READY                                        \
                                        (AESADV_CPU_INT_IMASK_INPUTRDY_SET)

/*!
 *  @brief AESADV Saved Context Ready interrupt. TAG and/or IV blocks are
 *         available to be retrieved by the CPU.
 */
#define DL_AESADV_INTERRUPT_SAVED_OUTPUT_CONTEXT_READY                         \
                                   (AESADV_CPU_INT_IMASK_SAVEDCNTXTRDY_SET)

/*!
 *  @brief AESADV Context Ready interrupt. Context bits can be overwritten.
 */
#define DL_AESADV_INTERRUPT_INPUT_CONTEXT_READY                                \
                                        (AESADV_CPU_INT_IMASK_CNTXTRDY_SET)

/** @}*/

/** @addtogroup DL_AESADV_EVENT
 *  @{
 */

/*!
 *  @brief DMA Trigger Event used to request the DMA write to DATAIN
 */
#define DL_AESADV_EVENT_DMA_DATA_INPUT_TRIGGER                                 \
                                           (AESADV_DMA_TRIG_DATAIN_IMASK_TRIG0_SET)

/*!
 *  @brief DMA Trigger Event used to request the DMA read from DATAOUT
 */
#define DL_AESADV_EVENT_DMA_DATA_OUTPUT_TRIGGER                                \
                                           (AESADV_DMA_TRIG_DATAOUT_IMASK_TRIG1_SET)

/** @}*/

/*!
 *  @brief AESADV Mode mask for all modes
 */
#define DL_AESADV_MODE_MASK                        ((AESADV_CTRL_CBC_MASK) | \
                (AESADV_CTRL_CTR_MASK)     |      (AESADV_CTRL_ICM_MASK) | \
                (AESADV_CTRL_CFB_MASK)     |   (AESADV_CTRL_CBCMAC_MASK) | \
                (AESADV_CTRL_GCM_MASK)     |      (AESADV_CTRL_CCM_MASK) | \
                (AESADV_CTRL_OFB_GCM_CCM_CONT_MASK) | 0x02000000)

/* TODO: create define once XCBC-MAC MASK defined in IPXACT */

/* clang-format on */

/*! @enum DL_AESADV_IIDX */
typedef enum {
    /*! AESADV interrupt index for input context ready to be written */
    DL_AESADV_IIDX_INPUT_CONTEXT_READY = AESADV_CPU_INT_IIDX_STAT_CNTXTRDY,
    /*! AESADV interrupt index for saved output context (tag/IV) available */
    DL_AESADV_IIDX_SAVED_OUTPUT_CONTEXT_READY =
        AESADV_CPU_INT_IIDX_STAT_SAVEDCNTXTRDY,
    /*! AESADV interrupt index indicating the engine can take more input.
     *  Not compatible with @ref DL_AESADV_enableDMAOperation */
    DL_AESADV_IIDX_INPUT_READY = AESADV_CPU_INT_IIDX_STAT_INPUTRDY,
    /*! AESADV interrupt index indicating the engine has available output data.
     *  Not compatible with @ref DL_AESADV_enableDMAOperation */
    DL_AESADV_IIDX_OUTPUT_READY = AESADV_CPU_INT_IIDX_STAT_OUTPUTRDY,
    /*! AES interrupt index for enabling DMA input request trigger event */
    DL_AESADV_IIDX_DMA_INPUT_TRIGGER = AESADV_DMA_TRIG_DATAIN_IIDX_STAT_TRIG0,
    /*! AES interrupt index for enabling DMA output request trigger event */
    DL_AESADV_IIDX_DMA_OUTPUT_TRIGGER =
        AESADV_DMA_TRIG_DATAOUT_IIDX_STAT_TRIG1,
} DL_AESADV_IIDX;

/*! @enum DL_AESADV_MODE */
typedef enum {
    /*! Electronic Codebook (ECB) mode */
    DL_AESADV_MODE_ECB = 0x00,
    /*! Cipher Block Chaining (CBC) mode */
    DL_AESADV_MODE_CBC = (AESADV_CTRL_CBC_ENABLE),
    /*! Counter (CTR) mode */
    DL_AESADV_MODE_CTR = (AESADV_CTRL_CTR_ENABLE),
    /*! Integer Counter Mode (ICM). ICM is a variant of CTR with a 16-bit wide
     *  counter */
    DL_AESADV_MODE_ICM = (AESADV_CTRL_ICM_ENABLE),
    /*! Cipher Feedback (CFB) mode */
    DL_AESADV_MODE_CFB = (AESADV_CTRL_CFB_ENABLE),
    /*! Output Feedback (OFB) mode */
    DL_AESADV_MODE_OFB = (AESADV_CTRL_OFB_GCM_CCM_CONT_OFB),
    /*! Cipher-based message authentication code (CMAC). */
    DL_AESADV_MODE_CMAC =
        (0x02000000 |
            AESADV_CTRL_CBC_ENABLE), /* TODO: add CMAC-define when given */
    /*! Cipher block chaining message authentication code (CBC-MAC) mode */
    DL_AESADV_MODE_CBCMAC = (AESADV_CTRL_CBCMAC_ENABLE),
    /* TODO: Update GCM values once new defines in place */
    /*! Galois/Counter Mode (GCM) with GHASH (GHASH_H loaded and Y0-encrypted
     *  forced to 0) */
    DL_AESADV_MODE_GCM_FORCE_ZERO =
        (AESADV_CTRL_GCM_FORCE_ZERO) | (AESADV_CTRL_CTR_ENABLE),
    /*! Galois/Counter Mode (GCM) with GHASH (H loaded Y0-encrypted
     *  calculated internally) */
    DL_AESADV_MODE_GCM_LOAD_HASH_KEY =
        (AESADV_CTRL_GCM_LOAD_HASH_KEY) | (AESADV_CTRL_CTR_ENABLE),
    /*! Galois/Counter Mode (GCM) with Autonomous GHASH (Both H and Y0-encrypted
     *  calculated internally) */
    DL_AESADV_MODE_GCM_AUTONOMOUS =
        (AESADV_CTRL_GCM_AUTONOMOUS) | (AESADV_CTRL_CTR_ENABLE),
    /*! Galois/Counter Mode GHASH only. Direction must be Decrypt */
    DL_AESADV_MODE_GCM_GHASH_ONLY = (AESADV_CTRL_GCM_FORCE_ZERO),
    /*! Cipher block chaining, message authentication code (CCM) mode */
    DL_AESADV_MODE_CCM = (AESADV_CTRL_CCM_ENABLE) | (AESADV_CTRL_CTR_ENABLE),
} DL_AESADV_MODE;

/*! @enum DL_AESADV_KEY_SIZE */
typedef enum {
    /*! 128-bit Key Size */
    DL_AESADV_KEY_SIZE_128_BIT = AESADV_CTRL_KEYSIZE_K128,
    /*! 256-bit Key Size */
    DL_AESADV_KEY_SIZE_256_BIT = AESADV_CTRL_KEYSIZE_K256,
} DL_AESADV_KEY_SIZE;

/*! @enum DL_AESADV_DIR */
typedef enum {
    /*! Encryption */
    DL_AESADV_DIR_ENCRYPT = AESADV_CTRL_DIR_ENCRYPT,
    /*! Decryption */
    DL_AESADV_DIR_DECRYPT = AESADV_CTRL_DIR_DECRYPT,
} DL_AESADV_DIR;

/*! @enum DL_AESADV_CTR_WIDTH */
typedef enum {
    /*! Counter (CTR) mode 32-bit counter */
    DL_AESADV_CTR_WIDTH_32_BIT = AESADV_CTRL_CTR_WIDTH_CTR32,
    /*! Counter (CTR) mode 64-bit counter */
    DL_AESADV_CTR_WIDTH_64_BIT = AESADV_CTRL_CTR_WIDTH_CTR64,
    /*! Counter (CTR) mode 96-bit counter */
    DL_AESADV_CTR_WIDTH_96_BIT = AESADV_CTRL_CTR_WIDTH_CTR96,
    /*! Counter (CTR) mode 128-bit counter */
    DL_AESADV_CTR_WIDTH_128_BIT = AESADV_CTRL_CTR_WIDTH_CTR128,
} DL_AESADV_CTR_WIDTH;

/*! @enum DL_AESADV_FB_WIDTH */
typedef enum {
    DL_AESADV_FB_WIDTH_128 = AESADV_CTRL_CTR_WIDTH_CFB128,
} DL_AESADV_FB_WIDTH;

/*! @enum DL_AESADV_CCM_CTR_WIDTH */
typedef enum {
    /*! Counter field width of 2 bytes (value of 1 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_2_BYTES = ((uint32_t) 1U << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 3 bytes (value of 2 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_3_BYTES = ((uint32_t) 2 << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 4 bytes (value of 3 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_4_BYTES = ((uint32_t) 3 << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 5 bytes (value of 4 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_5_BYTES = ((uint32_t) 4 << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 6 bytes (value of 5 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_6_BYTES = ((uint32_t) 5 << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 7 bytes (value of 6 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_7_BYTES = ((uint32_t) 6 << AESADV_CTRL_CCML_OFS),
    /*! Counter field width of 8 bytes (value of 7 stored in CCM-L) */
    DL_AESADV_CCM_CTR_WIDTH_8_BYTES = ((uint32_t) 7 << AESADV_CTRL_CCML_OFS),
} DL_AESADV_CCM_CTR_WIDTH;

/*! @enum DL_AESADV_CCM_TAG_WIDTH */
typedef enum {
    /*! Authentication field width of 1 byte  (value of 0 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_1_BYTE = ((uint32_t) 0 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 2 bytes (value of 1 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_2_BYTES = ((uint32_t) 1 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 3 bytes (value of 2 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_3_BYTES = ((uint32_t) 2 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 4 bytes (value of 3 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_4_BYTES = ((uint32_t) 3 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 5 bytes (value of 4 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_5_BYTES = ((uint32_t) 4 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 6 bytes (value of 5 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_6_BYTES = ((uint32_t) 5 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 7 bytes (value of 6 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_7_BYTES = ((uint32_t) 6 << AESADV_CTRL_CCMM_OFS),
    /*! Authentication field width of 8 bytes (value of 7 stored in CCM-M) */
    DL_AESADV_CCM_TAG_WIDTH_8_BYTES = ((uint32_t) 7 << AESADV_CTRL_CCMM_OFS),
} DL_AESADV_CCM_TAG_WIDTH;

/*! @enum DL_AESADV_STATUS */
typedef enum {
    /*! Operation was successful */
    DL_AESADV_STATUS_SUCCESS,
    /*! Operation was not performed because address was unaligned */
    DL_AESADV_STATUS_UNALIGNED_ACCESS,
} DL_AESADV_STATUS;

/**
 *  @brief Configuration structure for the AESADV module. It contains the
 *         superset of configurable information for the control module.
 */
typedef struct {
    /*! Mode field, one of @ref DL_AESADV_MODE */
    DL_AESADV_MODE mode;
    /*! Encrypt or decrypt, one of @ref DL_AESADV_DIR. Note that CBCMAC cannot
     *  be configured with the decrypt direction */
    DL_AESADV_DIR direction;
    /*! Counter mode (CTR) counter width, one of @ref DL_AESADV_CTR_WIDTH. CTR
     *  width is also used in combined operation modes CCM and GCM */
    DL_AESADV_CTR_WIDTH ctr_ctrWidth;
    /*! Cipher Feedback (CFB) feedback width, one of @ref DL_AESADV_FB_WIDTH */
    DL_AESADV_FB_WIDTH cfb_fbWidth;
    /*! CCM width of the counter length field for CCM operations, one of
     *  @ref DL_AESADV_CCM_CTR_WIDTH. The ctr_width parameter must be equal to
     *  or larger than this value */
    DL_AESADV_CCM_CTR_WIDTH ccm_ctrWidth;
    /*! CCM Width of the authentication field for CCM operations, one of
     *  @ref DL_AESADV_CCM_TAG_WIDTH */
    DL_AESADV_CCM_TAG_WIDTH ccm_tagWidth;
    /*! Initialization Vector. Should be 32-bit aligned */
    uint8_t *iv;
    /*! Nonce in the case of CCM, this should point to the nonce. Refer to
    *  @ref DL_AESADV_loadCCMNonceAndCounter in order to determine nonce length
    *  used  */
    uint8_t *nonce;
    /*! Derived key K1, used in the authentication-only mode CMAC
     *  Must be 32-bit aligned and equal to the block size (128-bits) */
    uint8_t *k1;
    /*! Derived key K2, used in the authentication-only mode CMAC
     *  must be 32-bit aligned and equal to the block size (128-bits) */
    uint8_t *k2;
    /*! Crypto Data Length - 61-bit value expressed as an upper value and lower
     *  value. This is the lower 32-bits */
    uint32_t lowerCryptoLength;
    /*! Crypto Data Length - 61-bit value expressed as an upper value and lower
     *  value. This is the upper 29-bits */
    uint32_t upperCryptoLength;
    /*! Additional Authentication Data (AAD) Length. CCM/GCM specific */
    uint32_t aadLength;
} DL_AESADV_Config;

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the AESADV
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_enablePower(AESADV_Regs *aesadv)
{
    aesadv->GPRCM.PWREN =
        (AESADV_PWREN_KEY_UNLOCK_W | AESADV_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the AESADV
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings
 *
 *  @param[in] aesadv        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_disablePower(AESADV_Regs *aesadv)
{
    aesadv->GPRCM.PWREN =
        (AESADV_PWREN_KEY_UNLOCK_W | AESADV_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the AESADV
 *        is enabled
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_AESADV_isPowerEnabled(const AESADV_Regs *aesadv)
{
    return ((aesadv->GPRCM.PWREN & AESADV_PWREN_ENABLE_MASK) ==
            AESADV_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief Resets AESADV module
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_AESADV_reset(AESADV_Regs *aesadv)
{
    aesadv->GPRCM.RSTCTL =
        (AESADV_RSTCTL_KEY_UNLOCK_W | AESADV_RSTCTL_RESETSTKYCLR_CLR |
            AESADV_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief Returns if AESADV module was reset
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   Peripheral was reset
 *  @retval false  Peripheral wasn't reset
 */
__STATIC_INLINE bool DL_AESADV_isReset(const AESADV_Regs *aesadv)
{
    return ((aesadv->GPRCM.STAT & AESADV_STAT_RESETSTKY_MASK) ==
            AESADV_STAT_RESETSTKY_RESET);
}

/**
 *  @brief Returns if an AES output block is available to be read
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   AES output block is available
 *  @retval false  No AES output block is available
 */
__STATIC_INLINE bool DL_AESADV_isOutputReady(const AESADV_Regs *aesadv)
{
    return ((aesadv->CTRL & AESADV_CTRL_OUTPUT_RDY_MASK) ==
            AESADV_CTRL_OUTPUT_RDY_READY);
}

/**
 *  @brief Returns if the input buffer is empty, and more data can be written
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @retval true   Input buffer is empty
 *  @retval false  Input buffer is not empty
 */
__STATIC_INLINE bool DL_AESADV_isInputReady(const AESADV_Regs *aesadv)
{
    return ((aesadv->CTRL & AESADV_CTRL_INPUT_RDY_MASK) ==
            AESADV_CTRL_INPUT_RDY_EMPTY);
}

/**
 *  @brief Sets the direction of the engine (encrypt/decrypt)
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *  @param[in] direction    Direction. One of @ref DL_AESADV_DIR.
 *
 *  @note CBC-MAC must be configured as encrypt (@ref DL_AESADV_DIR_ENCRYPT).
 */
__STATIC_INLINE void DL_AESADV_setDirection(
    AESADV_Regs *aesadv, DL_AESADV_DIR direction)
{
    DL_Common_updateReg(
        &aesadv->CTRL, (uint32_t) direction, AESADV_CTRL_DIR_MASK);
}

/**
 *  @brief Returns the direction of the AESADV peripheral (encrypt/decrypt)
 *
 *  @param[in] aesadv       Pointer to the register overlay for the peripheral
 *
 *  @return one of @ref DL_AESADV_DIR
 */
__STATIC_INLINE DL_AESADV_DIR DL_AESADV_getDirection(const AESADV_Regs *aesadv)
{
    uint32_t direction = (aesadv->CTRL & AESADV_CTRL_DIR_MASK);

